{
  "Title": "Menu",
  "Description": "Our extensive menu offers mouth watering dishes, made fresh every single day. Click on an item to learn more!",
  "MenuItems": {
    "Appetizers": [
      {
        "name": "Samosa",
        "price": "5.5",
        "image": "https://www.indianhealthyrecipes.com/wp-content/uploads/2021/12/samosa-recipe.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Crispy and savory with a hint of spice",
        "servingSize": "2-3 people",
        "detail": "Our samosas are a beloved family recipe, cherished by our grandma. These crispy, golden pastries are stuffed with a flavorful mixture of potatoes, peas, and spices. Originating from North India, samosas are a popular street food and an essential part of Indian cuisine. Our grandma's secret spice blend adds a unique touch that keeps customers coming back for more."
      },
      {
        "name": "Paneer Tikka",
        "price": 7,
        "image": "https://sharethespice.com/wp-content/uploads/2024/02/Paneer-Tikka-Featured.jpg",
        "spiceLevel": "Spicy",
        "flavourProfile": "Smoky, tangy, and rich",
        "servingSize": "2-3 people",
        "detail": "Paneer Tikka is a classic vegetarian dish made with chunks of paneer marinated in a blend of yogurt and spices, then grilled to perfection. This dish is known for its smoky flavor and rich, tangy taste. Our Paneer Tikka is a tribute to our family's love for grilling, especially during festive gatherings. The recipe has been passed down for generations and continues to be a favorite at our restaurant."
      },
      {
        "name": "Aloo Tikki",
        "price": 6,
        "image": "https://assets.bonappetit.com/photos/602c3f3947d6e85be58927ab/1:1/w_2560%2Cc_limit/Basically-AlooTikki.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Crispy, savory, and aromatic",
        "servingSize": "2-3 people",
        "detail": "Aloo Tikki is a popular North Indian snack made from boiled potatoes, peas, and spices, fried until crispy and golden. This dish is a staple at our family gatherings, especially during the monsoon season. The aromatic blend of spices in our Aloo Tikki brings back memories of cozy evenings spent with family, sharing stories and enjoying delicious food."
      },
      {
        "name": "Pakora",
        "price": 5,
        "image": "https://www.scrumptiously.com/wp-content/uploads/2023/02/VegetablePakora.webp",
        "spiceLevel": "Mild",
        "flavourProfile": "Crunchy, spicy, and flavorful",
        "servingSize": "2-3 people",
        "detail": "Pakoras are a beloved Indian snack made from vegetables dipped in a spiced gram flour batter and deep-fried to perfection. This dish is synonymous with rainy days in our family, as our grandma would make pakoras for us to enjoy with a cup of masala chai. The crunchy exterior and the flavorful, spicy interior make pakoras an irresistible treat."
      }
    ],
    "Main Course": [
      {
        "name": "Butter Chicken",
        "price": 12,
        "image": "https://images.immediate.co.uk/production/volatile/sites/30/2021/02/butter-chicken-ac2ff98.jpg?quality=90&resize=440,400",
        "spiceLevel": "Mild",
        "flavourProfile": "Rich, creamy, and savory",
        "servingSize": "2-3 people",
        "detail": "Butter Chicken, or Murgh Makhani, is a popular dish in Indian cuisine, known for its rich and creamy tomato-based sauce. Our version is a family favorite, inspired by a recipe handed down through generations. The tender chicken pieces are marinated in a blend of spices and yogurt, then cooked to perfection in a buttery sauce. This dish is a testament to the culinary heritage of Punjab and is sure to delight your taste buds."
      },
      {
        "name": "Paneer Butter Masala",
        "price": 11,
        "image": "https://www.vegrecipesofindia.com/wp-content/uploads/2020/01/paneer-butter-masala-5.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Creamy, tangy, and mildly spiced",
        "servingSize": "2-3 people",
        "detail": "Paneer Butter Masala is a rich and creamy dish made with paneer cubes cooked in a tomato-based sauce. This vegetarian delight is a favorite at our family dinners, especially during festive occasions. The smooth, buttery gravy, combined with the soft paneer, creates a deliciously satisfying meal that is sure to please everyone at the table."
      },
      {
        "name": "Rogan Josh",
        "price": 14,
        "image": "https://glebekitchen.com/wp-content/uploads/2021/12/roganjoshhoteltopkadai.jpg",
        "spiceLevel": "Spicy",
        "flavourProfile": "Rich, aromatic, and spicy",
        "servingSize": "2-3 people",
        "detail": "Rogan Josh is a traditional Kashmiri dish known for its deep red color and rich, aromatic flavors. This dish is made with tender pieces of lamb cooked in a blend of yogurt, garlic, and a variety of spices. Our version pays homage to the traditional preparation methods while adding a touch of our own family's culinary secrets. Rogan Josh is a perfect representation of the rich heritage of Kashmiri cuisine."
      },
      {
        "name": "Biryani",
        "price": 10,
        "image": "https://bakewithzoha.com/wp-content/uploads/2024/03/chicken-biryani-featured-1.jpg",
        "spiceLevel": "Spicy",
        "flavourProfile": "Fragrant, spicy, and flavorful",
        "servingSize": "2-3 people",
        "detail": "Biryani is a fragrant rice dish layered with marinated meat and a blend of spices. Originating from the Mughal era, biryani has become a beloved dish across India. Our family's biryani recipe is a closely guarded secret, with each layer of rice and meat infused with a symphony of flavors. This dish is a true celebration of the art of Indian cooking."
      },
      {
        "name": "Palak Paneer",
        "price": 11,
        "image": "https://healthynibblesandbits.com/wp-content/uploads/2020/01/Saag-Paneer-FF.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Creamy, savory, and mildly spiced",
        "servingSize": "2-3 people",
        "detail": "Palak Paneer is a nutritious and delicious dish made with paneer cubes cooked in a smooth spinach gravy. This dish is a staple in our family, especially during the winter months when fresh spinach is in season. The creamy spinach sauce, combined with the soft paneer, creates a comforting and wholesome meal that is perfect for any occasion."
      },
      {
        "name": "Chole Bhature",
        "price": 9,
        "image": "https://headbangerskitchen.com/wp-content/uploads/2024/03/BEEFCHOLE-H1.jpg",
        "spiceLevel": "Spicy",
        "flavourProfile": "Savory, spicy, and tangy",
        "servingSize": "2-3 people",
        "detail": "Chole Bhature is a popular North Indian dish consisting of spicy chickpeas (chole) served with deep-fried bread (bhature). This dish is a favorite at our family gatherings, especially during special occasions. The tangy and spicy chickpeas, paired with the fluffy bhature, make for a delicious and satisfying meal that is sure to be a hit with everyone."
      },
      {
        "name": "Lamb Vindaloo",
        "price": 15,
        "image": "https://www.cubesnjuliennes.com/wp-content/uploads/2023/10/Lamb-Vindaloo-Recipe.jpg",
        "spiceLevel": "Very Spicy",
        "flavourProfile": "Tangy, spicy, and bold",
        "servingSize": "2-3 people",
        "detail": "Lamb Vindaloo is a fiery Goan dish with roots in Portuguese cuisine. This dish features tender lamb pieces marinated in vinegar and spices, then cooked in a spicy sauce with potatoes. Our recipe balances the bold flavors with just the right amount of heat, making it a favorite for those who enjoy spicy food. This dish is a great representation of the diverse culinary influences in Indian cuisine."
      },
      {
        "name": "Fish Curry",
        "price": 13,
        "image": "https://www.teaforturmeric.com/wp-content/uploads/2023/06/Fish-Curry-Recipe.jpg",
        "spiceLevel": "Medium",
        "flavourProfile": "Savory, tangy, and aromatic",
        "servingSize": "2-3 people",
        "detail": "Fish Curry is a staple in coastal Indian cuisine, particularly in regions like Goa and Kerala. Our version of this dish features fresh fish cooked in a tangy and aromatic coconut-based sauce. The use of traditional spices and ingredients gives this curry its distinctive flavor, making it a delicious and wholesome meal that's perfect for seafood lovers."
      },
      {
        "name": "Dal Makhani",
        "price": 10,
        "image": "https://www.funfoodfrolic.com/wp-content/uploads/2023/04/Dal-Makhani-Blog.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Creamy, rich, and earthy",
        "servingSize": "2-3 people",
        "detail": "Dal Makhani is a classic North Indian dish made with black lentils and kidney beans, cooked in a rich and creamy tomato-based sauce. This dish is slow-cooked to perfection, allowing the flavors to meld beautifully. Our family's recipe adds a touch of love and tradition to this comforting and satisfying meal, which is best enjoyed with naan or rice."
      },
      {
        "name": "Aloo Gobi",
        "price": 9,
        "image": "https://www.indianhealthyrecipes.com/wp-content/uploads/2022/03/aloo-gobi-recipe.jpg",
        "spiceLevel": "Medium",
        "flavourProfile": "Savory, earthy, and mildly spiced",
        "servingSize": "2-3 people",
        "detail": "Aloo Gobi is a popular vegetarian dish made with potatoes (aloo) and cauliflower (gobi), cooked with a blend of spices. This simple yet flavorful dish is a staple in our family, often served during weeknight dinners. The combination of tender potatoes and cauliflower, infused with aromatic spices, makes this dish a comforting and wholesome meal that's perfect for any occasion."
      },
      {
        "name": "Chicken Korma",
        "price": 12,
        "image": "https://www.eitanbernath.com/wp-content/uploads/2021/12/Eitan-Bernath-Chicken-Korma-2-819x1024.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Rich, creamy, and aromatic",
        "servingSize": "2-3 people",
        "detail": "Chicken Korma is a luxurious dish made with chicken pieces cooked in a rich and creamy sauce made from yogurt, cream, and a blend of aromatic spices. This dish has a royal heritage, being a favorite in Mughlai cuisine. Our version is a family favorite, enjoyed during special occasions and celebrations. The delicate flavors and creamy texture make this dish a true delight for the senses."
      }
    ],
    "Breads": [
      {
        "name": "Naan",
        "price": 3,
        "image": "https://rainbowplantlife.com/wp-content/uploads/2021/09/updated-naan-photo-for-cover-image-1-of-1-1.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Soft, buttery, and slightly charred",
        "servingSize": "2-3 people",
        "detail": "Naan is a soft and fluffy Indian bread that is traditionally cooked in a tandoor oven. Our naan is made using a family recipe that has been perfected over generations. The soft texture and slightly charred edges make it the perfect accompaniment to any curry or gravy dish. This bread is a staple in our family, especially during festive meals and special occasions."
      },
      {
        "name": "Roti",
        "price": 2,
        "image": "https://spicecravings.com/wp-content/uploads/2020/12/Roti-Featured-1-500x500.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Light, fluffy, and slightly nutty",
        "servingSize": "2-3 people",
        "detail": "Roti is a simple, unleavened Indian bread made from whole wheat flour. It is a staple in our family, served with almost every meal. The light and fluffy texture, combined with its slightly nutty flavor, makes roti a perfect accompaniment to a variety of dishes. Our roti is made fresh daily, just like our grandma used to make."
      },
      {
        "name": "Paratha",
        "price": 4,
        "image": "https://thewhiskaddict.com/wp-content/uploads/2024/01/IMG_9911-scaled.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Flaky, buttery, and savory",
        "servingSize": "2-3 people",
        "detail": "Paratha is a flaky, layered Indian bread made from whole wheat flour and ghee. This bread is a favorite in our family, especially during weekend breakfasts. The flaky layers and buttery flavor make paratha a delicious treat that can be enjoyed on its own or with a variety of curries and gravies."
      },
      {
        "name": "Puri",
        "price": 3,
        "image": "https://www.indianveggiedelight.com/wp-content/uploads/2020/10/poori-recipe-featured.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Crispy, light, and slightly savory",
        "servingSize": "2-3 people",
        "detail": "Puri is a deep-fried Indian bread made from whole wheat flour. This bread is a staple in our family during special occasions and festivals. The crispy texture and light, airy interior make puri a delightful accompaniment to a variety of dishes. Our puris are made using a traditional family recipe that has been passed down through generations."
      }
    ],
    "Rice": [
      {
        "name": "Plain Rice",
        "price": 2,
        "image": "https://bigoven-res.cloudinary.com/image/upload/t_recipe-1280/plain-white-rice-f7391e.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Light, fluffy, and slightly nutty",
        "servingSize": "2-3 people",
        "detail": "Plain rice is a staple in Indian cuisine, served with almost every meal. Our plain rice is cooked to perfection, with each grain light and fluffy. This simple yet essential dish is a favorite in our family, providing the perfect base for a variety of flavorful curries and gravies."
      },
      {
        "name": "Jeera Rice",
        "price": 3,
        "image": "https://pipingpotcurry.com/wp-content/uploads/2017/07/jeera-rice-instant-pot-Piping-Pot-Curry-2-500x375.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Fragrant, savory, and slightly nutty",
        "servingSize": "2-3 people",
        "detail": "Jeera Rice is a fragrant rice dish made with basmati rice and cumin seeds. This dish is a favorite in our family, especially during festive occasions. The aromatic cumin seeds add a savory flavor to the rice, making it the perfect accompaniment to a variety of curries and gravies. Our Jeera Rice is made using a traditional family recipe that has been passed down through generations."
      },
      {
        "name": "Pulao",
        "price": 4,
        "image": "https://www.indianhealthyrecipes.com/wp-content/uploads/2023/05/chicken-pulao-recipe.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Fragrant, savory, and slightly spicy",
        "servingSize": "2-3 people",
        "detail": "Pulao is a fragrant rice dish made with basmati rice, vegetables, and a blend of spices. This dish is a favorite in our family, especially during special occasions and festive meals. The aromatic spices and the vibrant mix of vegetables make Pulao a delicious and satisfying dish that is sure to please everyone."
      },
      {
        "name": "Lemon Rice",
        "price": 4,
        "image": "https://www.secondrecipe.com/wp-content/uploads/2020/08/lemon-rice-2021.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Tangy, savory, and slightly spicy",
        "servingSize": "2-3 people",
        "detail": "Lemon Rice is a flavorful rice dish made with basmati rice, lemon juice, and a blend of spices. This dish is a favorite in our family, especially during summer picnics and gatherings. The tangy lemon flavor, combined with the aromatic spices, makes Lemon Rice a refreshing and delicious dish that is perfect for any occasion."
      }
    ],
    "Desserts": [
      {
        "name": "Gulab Jamun",
        "price": 5,
        "image": "https://static01.nyt.com/images/2023/10/19/multimedia/ND-Gulab-Jamun-tqgl/ND-Gulab-Jamun-tqgl-square640.jpg",
        "spiceLevel": "Sweet",
        "flavourProfile": "Sweet, soft, and syrupy",
        "servingSize": "2-3 people",
        "detail": "Gulab Jamun is a popular Indian dessert made from milk solids, deep-fried and soaked in a sweet syrup. This dessert is a favorite in our family, especially during festivals and celebrations. The soft, melt-in-your-mouth texture and the sweet, fragrant syrup make Gulab Jamun an irresistible treat that is sure to delight everyone."
      },
      {
        "name": "Rasgulla",
        "price": 5,
        "image": "https://madhurasrecipe.com/wp-content/uploads/2023/10/Rasgulla-Featured-Image.jpg",
        "spiceLevel": "Sweet",
        "flavourProfile": "Sweet, spongy, and syrupy",
        "servingSize": "2-3 people",
        "detail": "Rasgulla is a popular Bengali dessert made from chhena (Indian cottage cheese) and soaked in a sweet syrup. This dessert is a favorite in our family, especially during festive occasions. The spongy texture and the sweet, fragrant syrup make Rasgulla a delightful treat that is perfect for any celebration."
      },
      {
        "name": "Jalebi",
        "price": 4,
        "image": "https://sinfullyspicy.com/wp-content/uploads/2014/10/1200-by-1200-images-1.jpg",
        "spiceLevel": "Sweet",
        "flavourProfile": "Crispy, sweet, and syrupy",
        "servingSize": "2-3 people",
        "detail": "Jalebi is a popular Indian dessert made from deep-fried batter soaked in a sweet syrup. This dessert is a favorite in our family, especially during festivals and special occasions. The crispy texture and the sweet, fragrant syrup make Jalebi an irresistible treat that is sure to delight everyone."
      },
      {
        "name": "Kheer",
        "price": 6,
        "image": "https://www.cookwithmanali.com/wp-content/uploads/2017/06/Indian-Rice-Kheer-500x375.jpg",
        "spiceLevel": "Sweet",
        "flavourProfile": "Creamy, sweet, and aromatic",
        "servingSize": "2-3 people",
        "detail": "Kheer is a popular Indian dessert made from rice, milk, and sugar, flavored with cardamom and garnished with nuts. This dessert is a favorite in our family, especially during festive occasions. The creamy texture and the aromatic flavors make Kheer a delightful treat that is perfect for any celebration."
      },
      {
        "name": "Ladoo",
        "price": 5,
        "image": "https://ashbaber.com/wp-content/uploads/2023/06/Ladoo-on-a-plate-small.jpg",
        "spiceLevel": "Sweet",
        "flavourProfile": "Sweet, soft, and slightly nutty",
        "servingSize": "2-3 people",
        "detail": "Ladoo is a popular Indian sweet made from gram flour, sugar, and ghee, flavored with cardamom and garnished with nuts. This dessert is a favorite in our family, especially during festive occasions. The soft texture and the sweet, nutty flavor make Ladoo an irresistible treat that is perfect for any celebration."
      }
    ],
    "Beverages": [
      {
        "name": "Masala Chai",
        "price": 3,
        "image": "https://masalaandchai.com/wp-content/uploads/2021/07/Masala-Chai.jpg",
        "spiceLevel": "Spicy",
        "flavourProfile": "Spicy, aromatic, and invigorating",
        "servingSize": "2-3 people",
        "detail": "Masala Chai is a traditional Indian tea made with black tea, milk, and a blend of spices. This beverage is a favorite in our family, especially during chilly mornings. The aromatic spices and the invigorating flavor make Masala Chai a perfect start to the day. Our Masala Chai is made using a traditional family recipe that has been passed down through generations."
      },
      {
        "name": "Lassi",
        "price": 4,
        "image": "https://www.simplyrecipes.com/thmb/M3LEdeKC37xv52FUmIBFJVXKBFY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Mango-Lassi-LEAD-13-73719759cc3f4a2ca7fe8be72baaeaab.jpg",
        "spiceLevel": "Sweet",
        "flavourProfile": "Sweet, creamy, and refreshing",
        "servingSize": "2-3 people",
        "detail": "Lassi is a popular Indian yogurt-based drink made with yogurt, water, and sugar. This beverage is a favorite in our family, especially during hot summer days. The creamy texture and the refreshing flavor make Lassi a perfect drink to cool down and enjoy. Our Lassi is made using a traditional family recipe that has been passed down through generations."
      },
      {
        "name": "Buttermilk",
        "price": 3,
        "image": "https://cookieandkate.com/images/2021/06/buttermilk-recipe-1.jpg",
        "spiceLevel": "Mild",
        "flavourProfile": "Tangy, creamy, and refreshing",
        "servingSize": "2-3 people",
        "detail": "Buttermilk is a popular Indian drink made with yogurt, water, and spices. This beverage is a favorite in our family, especially during hot summer days. The tangy flavor and the creamy texture make Buttermilk a refreshing and delicious drink that is perfect for any occasion."
      },
      {
        "name": "Nimbu Pani",
        "price": 3,
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSuCwVAI6w23gFd4RhfyTD3yzeDqnz0yc_0Kw&s",
        "spiceLevel": "Mild",
        "flavourProfile": "Tangy, sweet, and refreshing",
        "servingSize": "2-3 people",
        "detail": "Nimbu Pani is a popular Indian lemonade made with lemon juice, water, and sugar. This beverage is a favorite in our family, especially during hot summer days. The tangy flavor and the refreshing taste make Nimbu Pani a perfect drink to cool down and enjoy. Our Nimbu Pani is made using a traditional family recipe that has been passed down through generations."
      }
    ]
  }
}